[
    {
        "year": 2001,
        "events":
        [
            {
                "regions": ["Japan"],
                "text": "Super Smash Bros. Melee is released November 21st in Japan. The game launches to critical acclaim and captures an audience of diehard players who look to push the game to its limits."
            },
            {
                "regions": ["US West", "US Southwest", "US Northeast", "US Southeast", "US Midwest"],
                "text": "Super Smash Bros. Melee is released December 3rd in the US. Similar to Japan, the US finds a diehard playerbase that celebrate the game." 
            }
        ]
    },

    {
        "year": 2002,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "The first recorded competitve tournaments occur in California. This marks the start of the regions initial dominance in the game. The premier tournament series, Tournament Go, sees California's best players compete for #1. Notable is the series' ruleset, as items were enabled with a random stage list."
            },
            {
                "regions": ["US West"],
                "text": "Recipherus wins Tournament Go 2-3, setting himself up as the proclaimed best player in the world."
            },
            {
                "regions": ["Austria","Belgium","Bulgaria","Cyprus","Czech Republic","Denmark","Estonia","Finland","France","Germany","Greece","Hungary","Ireland","Italy","Latvia","Lithuania","Luxembourg","Malta","Netherlands","Poland","Portugal","Romania","Slovakia","Slovenia","Spain","Sweden","United Kingdom"],
                "text": "Super Smash Bros. Melee is released in Europe. Notable is Europe recieved an updated version of the game with major balance differences from the US and Japan versions. The release date and patch of the game puts them behind initially."
            }
        ]
    },


    {
        "year": 2003,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "California Marth main Ken competes in his first tournament: Tournament Go 4. He comes out victorious over Recipherus beginning his rise to the #1 player. His dominance would continue, earning him the title King of Smash. Ken becomes the main representative of the US west coast."
            },
            {
                "regions": ["US Southeast"],
                "text": "The earliest known Eastern US tournament series, DC Super Smash, is started. Melee crew H2YL take the top 3 spots in the tournament. The crew consisted of Azen, ChuDat, and Chillin; all players would be mainstays of the games top level for the coming years. Azen becomes the main representative of the US east coast."
            },
            {
                "regions": ["US West"],
                "text": "The first competition between the west and east of the US occurs at Tournament Go 5. Ken comes out victorious and claims the west to be the better coast of America. The east coast notes the ruleset having items on, making it a farce."
            },
            {
                "regions": ["Austria","Belgium","Bulgaria","Cyprus","Czech Republic","Denmark","Estonia","Finland","France","Germany","Greece","Hungary","Ireland","Italy","Latvia","Lithuania","Luxembourg","Malta","Netherlands","Poland","Portugal","Romania","Slovakia","Slovenia","Spain","Sweden","United Kingdom"],
                "text": "Super Smash Bros. Melee is released in Europe. Notable is Europe recieved an updated version of the game with major balance differences from the US and Japan version. The release date and patch of the game puts them behind initially."
            }
        ]
    },

    {
        "year": 2004,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "The west coast Melee players compete in the east coast for the first time at Game Over. For the first time in Ken's career, he loses in bracket. East coast player Chillindude sends him to losers and calls him a fraud. Ken proceeds to win the tournament from the losers bracket."
            },
            {
                "regions": ["Japan"],
                "text": "Japanese player Captain Jack travels to the US for the first time for the sixth and final Tournament Go. The tournament marked the largest tournament in the game's history, clocking in at 112 entrants. He surprises the entire US by placing 2nd overall. This along with other tournaments put Japan on the map with his 3rd overall ranking for 2004."
            },
            {
                "regions": ["US Southeast"],
                "text": "Azen wins the Tournament Go 6, the largest tournament in the game's history. This marks a big point for the east coasts skill, especially when Ken placed 9th."
            },
            {
                "regions": ["US West", "US Southwest", "US Northeast", "US Southeast", "US Midwest"],
                "text": "Major League Gaming begins their Melee circuit, creating one of the mainstay tournament series' for the game's early years."
            }
        ]
    },

    {
        "year": 2005,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "Ken wins the largest tournament of the year, MELEE-FC3 against 186 competitors. He also wins the MLG finals in New York. This cements him as the #1 player of 2005 and the game's most dominant player from 2001 onward."
            },
            {
                "regions": ["Japan"],
                "text": "Ken travels to the Jack Garden Tournament in Japan and wins. Notable is the appearance of Bombsoldier, a previously unknown Japanese Falco main who set the stage for Falco's surge in the game's future."
            },
            {
                "regions": ["US Southeast"],
                "text": "Though Ken maintains the #1 spot for the west, more high-level players begin to content in the east. This marks the first time in the game's history where the US east is considered the better region. East coast players Wife, Husband, andPC Chris begin to make the mark. Notable is Wife's set against Ken in MLG Atlanta 2005, where he nearly defeated the unanimous #1 player."
            },
            {
                "regions": ["US West"],
                "text": "California player Isai defeats Ken at the MOAST 5. This marks the first time Isai, Ken's training partner, defeats his friend in bracket. The set was considered one of the highest levels of play up to that point."
            }
        ]
    },

    {
        "year": 2006,
        "events":
        [
            {
                "regions": ["US Southeast", "US Northeast"],
                "text": "The east coast continues their improvement against the west coast. Notable new players include KoreanDJ, Mew2King, and PC Chris, who would have a 3-way rivalry in the coming years. These players along with Azen would prove a legitimate threat for the previous #1 player Ken."
            },
            {
                "regions": ["Canada"],
                "text": "For the first time, Canada becomes a contender in Melee, as Canadian Jigglypuff The King competes in the MLG circuit with solid placements."
            },
            {
                "regions": ["US Northeast"],
                "text": "PC Chris wins the MLG 2006 New York opener over Ken in a huge upset. This begins the most difficult year for Ken by far and continues the case for the east coast being better than the west."
            },
            {
                "regions": ["US West"],
                "text": "Despite a more challenging year than 2005, Ken again secures the #1 spot against a higher level of competition than previous years. After this year, Ken's interest in the game begins to wane and he slowly steps away from the game in the coming years."
            }
        ]
    },

    {
        "year": 2007,
        "events":
        [
            {
                "regions": ["US Southeast"],
                "text": "For the first time in the game's history, Ken is not ranked #1. Instead, the spot goes to Florida Marth main Mew2King as he has a dominant year by innovating Melee's combos. This continue's the eastern US's dominance over the west."
            },
            {
                "regions": ["Netherlands"],
                "text": "The European Melee scene becomes more active. The region crowns a #1 player, Amsah from the Netherlands. Throughout the whole year, he never lost a tournament in Europe."
            },
            {
                "regions": ["US Northeast"],
                "text": "KoreanDJ and PC Chris would content with Mew2King throughout the year. While they obtained a fair share of tournament victories, Mew2King would prove the most dominant."
            },
            {
                "regions": ["US West"],
                "text": "Though Ken's dominance ends at this period of time, a new representative from California emerges. Mango, a Jigglypuff main at the time, clutches a 3rd place position at EVO 2007 while defeating Mew2King along the way. He would later be known as Melee's GOAT."
            }
        ]
    },

    {
        "year": 2008,
        "events":
        [
            {
                "regions": ["US Southeast"],
                "text": "Mew2King would continue his #1 ranking for the second year in a row. Player's begin to belive he has taken Ken's place as the most dominant player."
            },
            {
                "regions": ["US West"],
                "text": "Mango climbs rapidly in the ranks, taking the #2 spot for the year and giving the west coast of Melee a case against the east. Notable is his victory at Pound 3, where he defeated the east coast's Mew2King, PC Chris, Azen, ChuDat; all considered among the regions best."
            },
            {
                "regions": ["Sweden"],
                "text": "Swedish Peach main Armada begins making a name for himself in Europe. He quickly becomes the country's #1 player and contends for Amsah's title as #1 in Europe. He would later become contender for #1 in the world."
            }
        ]
    },

    {
        "year": 2009,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "Mango reclaims the #1 rank spot for the west coast and further pushes the region back to its former glory. Other western US players like Zhu enter the ranks to assist Mango in reclaiming the regions #1 position."
            },
            {
                "regions": ["Sweden"],
                "text": "Armada travels to the US for the first time to compete in the California tournament Genesis. Though doubted by the US players at the time, Armada would make an incredible run to 2nd place in the tournament. He defeated many of America's best players, only to barely lose to Mango in the grand finals. This along with more tournaments cemented him as a surprise #2 for the year."
            },
            {
                "regions": ["US Southeast"],
                "text": "Florida Jigglypuff Hungrybox get ranked for the first time at a high 3rd place for the year. Another US Southeast player, PPMD, would find themsleves ranked for the first time too. Mango, Armada, Hungrybox, PPMD, and Mew2King would soon claim the title of the Five Gods, as they would be the only ones to win major tournaments for the netx five years."
            }
        ]
    },

    {
        "year": 2010,
        "events":
        [
            {
                "regions": ["US Southeast"],
                "text": "Hungrybox gets ranked #1 for the first time. He takes a career-defining 1st place at Apex 2010, the largest tournament that year."
            },
            {
                "regions": ["US West"],
                "text": "Mango gets ranked #2 for the year despite sandbagging and playing characters that are not his main. This begins his switch off of his original main, Jigglypuff."
            },
            {
                "regions": ["US Southeast"],
                "text": "Dr.PeePee/PPMD get ranked #5 for the year. He takes his first major win at Revival of Melee 3. This solidifies his spot as the 5th God of Melee."
            },
            {
                "regions": ["Canada"],
                "text": "Canada returns to the rankings in 2010 with their player KirbyKaze. He would take wins against the game's best like Mango and PPMD."
            }
        ]
    },

    {
        "year": 2011,
        "events":
        [
            {
                "regions": ["Sweden"],
                "text": "Armada gets ranked #1 for the first time. Notable is his victory at Genesis 2, where he defeated Mango in grand finals. This marks the first time a non-American gets ranked #1. The only player he lost to in 2011 was Dr.PeePee/PPMD."
            },
            {
                "regions": ["US West"],
                "text": "For the first time since 2004, the US West becomes the #1 region in Melee again. This is brought on by Mango's #2 ranking, as well as new California players like Lovage, Shroomed, S2J, and Zhu."
            },
            {
                "regions": ["US West"],
                "text": "Mango switches main from Jigglypuff to Fox and impresses the scene at Genesis 2. Despite his waning interest in the game, he again gets ranked #2."
            }
        ]
    },

    {
        "year": 2012,
        "events":
        [
            {
                "regions": ["Sweden"],
                "text": "Armada gets ranked #1 for the second year in a row. Again, he boasts an impressive record for the year, only losing to Hungrybox and Dr.PeePee/PPMD. A case for him attaining the same dominance as Ken begins to form."
            },
            {
                "regions": ["US Southeast"],
                "text": "The US Southeast reclaims the #1 region from the US West. This is largely due to Hungrybox and Dr.PeePee/PPMDs high ranks, as well as the lower ranks of the west coast falling off the ranks."
            },
            {
                "regions": ["Canada"],
                "text": "Canada returns to the ranks again on the back of KirbyKaze. In 2012, he became the first Sheik to defeat Hungrybox in tournament since he's been top five."
            }
        ]
    },

    {
        "year": 2013,
        "events":
        [
            {
                "regions": ["All"],
                "text": "The ranking get largely expanded to a top 100 list due to better data recording. This enables more regions to enter the ranks and have relatively lower-level players represent their regions. Melee would also see a return to EVO and a new documentary that boost interest in the game and attract more competitve players."
            },
            {
                "regions": ["US West"],
                "text": "The US West reclaims the #1 spot. This in part to Mango taking the #1 spot for the first time since 2009. Notable is his victory at EVO 2013, the largest Melee tournament up till that point. He would win the bracket from losers, defeating Armada, Hungrybox, and PPMD along the way."
            },
            {
                "regions": ["Sweden"],
                "text": "Sweden maintains its status as a threat in Melee, this time with more than just Armada. While Armada get the #2 rank, newcomer Leffen takes the #14 and further boosts the regions skill level."
            },
            {
                "regions": ["Japan"],
                "text": "Japan re-enters the ranks with their new best player: aMSA. aMSa would make an impressive run at EVO with a character thought to be terrible: Yoshi. While some called it a fluke at the time, he would continue to climb the ranks and is a top 5 player today."
            }
        ]
    },

    {
        "year": 2014,
        "events":
        [
            {
                "regions": ["US West"],
                "text": "Mango gets ranked #1 for the second year in a row; his first time repeating. In 2014, he won MLG Anaheim, EVO, Kings of Cali, and the Big House. His impressive showing 2 years in a row and the skill he displayed begin his argument for Melee's GOAT."
            },
            {
                "regions": ["Japan"],
                "text": "aMSa climbs a whopping 55 spots in the ranks, making him an anomaly in the game due to his region and character."
            },
            {
                "regions": ["Sweden"],
                "text": "Armada takes the #2 spot again this year. Leffen, also from Sweden, becomes one of the first non-top-five players to beat Armada in tournament since 2010. This clinches him the #6 rank for the year and the title as Melee's Godslayer."
            }
        ]
    },


    {
        "year": 2015,
        "events":
        [
            {
                "regions": ["Austria","Belgium","Bulgaria","Cyprus","Czech Republic","Denmark","Estonia","Finland","France","Germany","Greece","Hungary","Ireland","Italy","Latvia","Lithuania","Luxembourg","Malta","Netherlands","Poland","Portugal","Romania","Slovakia","Slovenia","Spain","Sweden","United Kingdom"],
                "text": "Melee see's rapid growth across Europe. The 2013 Documentary and EVO are likely the root cause of this growth. While relatively spread out, European competitors begin to pose a real challenge to the US."
            },
            {
                "regions": ["Sweden"],
                "text": "Armada returns to the #1 rank for 2015, along with Leffen at #2. This further spurs the growth of the European Melee scene."
            },
            {
                "regions": ["US West"],
                "text": "Despite Mango dropping from #1 to #4, the western US maintains their #1 position in large part to their deep pool of top 100 players."
            },
            {
                "regions": ["US Southeast"],
                "text": "The US southeast slowly begins to overtake the US west with player like Hungrybox boosting the regions skill level. Despite this, the US west breadth of players keeps them on top."
            }
        ]
    },

    {
        "year": 2016,
        "events":
        [
            {
                "regions": ["Sweden"],
                "text": "Armada takes the #1 spot for his second year in a row. Leffen however, drops in rank due to VISA issues preventing him from competing in the US. Despite this, Sweden maintains its position as a respectable region in Melee" 
            },
            {
                "regions": ["US Southeast"],
                "text": "The US southeast continues its climb to surpass the US west, only being slightly behind in 2016. Their star player, Hungrybox takes a solid #2 ranking for the year in a close race vs Armada. Notable is Hungrybox's victory at EVO 2016, where he defeated Mango and Armada from the losers bracket."
            }
        ]
    },

    {
        "year": 2017,
        "events":
        [
            {
                "regions": ["US Southeast"],
                "text": "The US southeast reclaims the #1 spot in large part from Hungrybox being ranked #1 for the year. This year marked his first #1 since 2010" 
            }
        ]
    },

    {
        "year": 2018,
        "events":
        [
            {
                "regions": ["US Southeast"],
                "text": "Hungrybox gets ranked #1 for his second year in a row. " 
            },
            {
                "regions": ["Sweden"],
                "text": "Sweden has its strongest showing yet, even coming close to the level of the former #1 US west. Armada and Leffen getting ranks #2 and #3 respectively have a large part in the regions higher skill level, as well as lower rank players like Android representing Sweden. Notable is Leffen's victory at Melee's final showing at EVO 2018, defeating Mango, Armada, and Hungrybox along the way."
            },
            {
                "regions": ["US Southeast"],
                "text": "Virginia player Zain rapidly climbs the ranks and takes the #7 spot for the year. He would continue to improve and become a serious threat in the coming years"
            }
        ]
    },

    {
        "year": 2019,
        "events":
        [
            {
                "regions": ["Sweden"],
                "text": "Sweden's #1 player, Armada, retires after 10 years of competing. Because of this, Sweden's rank among the regions drops significantly. Leffen however, maintains a #2 spot for the year and holds Sweden down as its new representative" 
            },
            {
                "regions": ["Canada"],
                "text": "Canada begins to makes its case as a more competitve region. This is lead by players like n0ne, moky, Soonsay, and Kage taking victories on some of Melee's best"
            },
            {
                "regions": ["US Southwest"],
                "text": "The US southwest makes its case as a more competitve region as well. This is in large part from Axe's impressive showing for the year, notably winning Smash Summit 8 for his homestate Arizona"
            }
        ]
    },

    {
        "year": 2020,
        "events":
        [
            {
                "regions": ["All"],
                "text": "COVID-19 shuts down all competition, leaving the year with no tournaments to base the rankings off of" 
            },
            {
                "regions": ["All"],
                "text": "Despite Melee launching in 2001 with no online features, community member Fizzi releases a modification called Slippi that enabled online play across the world. This allowed players to practice and improve even during the pandemic."
            }
        ]
    },

    {
        "year": 2021,
        "events":
        [
            {
                "regions": ["All"],
                "text": "The pandemic continues to keep competitors at home as they anxiously await their next competition. Later on in the year as the pandemic lets up, smaller scale invitationals occur." 
            },
            {
                "regions": ["US West"],
                "text": "Mango wins Smash Summit 11 from the losers bracket, making him the youngest and oldest player to win a major tournament. Though no ranking were made for the year, this victory along with others give him a clear case for #1 of 2021. This tournament victory solidifies Mango's argument as the greatest Melee player of all time."
            },
            {
                "regions": ["US Northeast"],
                "text": "New York begins improving during the pandemic and would become a force in Melee once the pandemic ends. Players like iBDW and Jmook use the new online Slippi mod to improve for when in-person Melee returns."
            }
        ]
    },

    {
        "year": 2022,
        "events":
        [
            {
                "regions": ["All"],
                "text": "The pandemic lockdown ends and Melee comes back in full force. A noticable shakeup occurs in the regions, as the map shows more color in regions beyond Europe and North America. This in large part from Slippi enabling weaker regions to practice across the world." 
            },
            {
                "regions": ["Australia"],
                "text": "An Australian player, Joshman, gets ranked for the first time. This is the regions first appearance as a threat in the regional rankings, though New Zealand had their own representative Spud on the lower ends of the ranks"
            },
            {
                "regions": ["Japan"],
                "text": "Japan has its strongest showing yet, due to their #1 player aMSa getting ranked 2nd for the year. Impressive is the fact that he is the sole representative of his character Yoshi, a character thought to be unviable to win tournaments. That year, he took a victory at The Big House 10, largely considered the most challenging tournament of all time."
            },
            {
                "regions": ["US Northeast"],
                "text": "New York's training during the pandemic paysoff as players iBDW and Jmook take ranks #4 and #6 respectively. Jmook in particular has the highest debut of any player to hit the rankings ever, going from unknown to #6 in the world. Of note is his cinderalla run at the start of the year in Genesis 8, taking 2nd place as an unknown player at the time."
            },
            {
                "regions": ["US Southeast"],
                "text": "Virginia's Zain takes the #1 ranking for the first time. This marks the first time since 2007 that a player outside of the Five Gods gets ranked #1. This ranking along with more players like Hungrybox solidify the US southeast's position as #1 post-COVID."
            }
        ]
    },


    {
        "year": 2023,
        "events":
        [
            {
                "regions": ["Sweden"],
                "text": "Due to focus on other games and travel issues, Leffen soft-retires from Melee leaving Sweden with no representative. Even still, Leffen would take an impressive tournament victory at LACS5 before he ends his career."
            },
            {
                "regions": ["US Northeast"],
                "text": "iBDW takes the #1 rank for the first time in his career. This marks the first time a solo Fox main gets the #1 rank in Melee. Furthermore, fellow New Yorker Jmook takes the #3 rank and solidifies the northeast as the US's 2nd best region."
            },
            {
                "regions": ["Canada"],
                "text": "Canada furhter improves its skill-level, even getting close to the level of the US west. Their best player, Moky, takes the #4 spot for the year, climbing the ranks from previous years. Him along with other Canadians like Soonsay begin to challenge the mainstay regions of the game and bring Canada up the ranks."
            },
            {
                "regions": ["US West"],
                "text": "The US west suffers a large falloff. This is due to many of their best players retiring from the game, as well as Mango losing motivation for the game. This would be his lowest ranking yet at #9."
            }
        ]
    }
]
